I'm having the same issue.  The resource pool selectors doesn't apply the list of selected rackunits/servers.  The code for creating the resource pool is the exact code from terraform import of existing working pool (manually created from Intersight GUI) with removing all read-only arguments.  When running terraform apply, the pool is created but without the selectors list.
```
tritu$ terraform apply --auto-approve
module.pools.data.intersight_organization_organization.default_org: Reading...
module.pools.data.intersight_organization_organization.cds_ce_org: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Reading...
module.pools.data.intersight_organization_organization.default_org: Read complete after 1s [id=60198e2c6972652d3096c7ac]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Read complete after 1s [id=64ad8817617675360127b7b2]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Read complete after 1s [id=649ded3361767536017e8026]
module.pools.data.intersight_organization_organization.cds_ce_org: Read complete after 1s [id=64c8268a6972653001e7242d]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Read complete after 1s [id=64b1efc46176753601075b86]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Read complete after 1s [id=64ad87e2617675360127a394]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL will be created
  + resource "intersight_resourcepool_pool" "CDS-CE-GLOBAL-POOL" {
      + account_moid             = (known after apply)
      + ancestors                = (known after apply)
      + assigned                 = (known after apply)
      + assignment_order         = "sequential"
      + class_id                 = "resourcepool.Pool"
      + create_time              = (known after apply)
      + domain_group_moid        = (known after apply)
      + id                       = (known after apply)
      + mod_time                 = (known after apply)
      + moid                     = (known after apply)
      + name                     = "CDS-CE-GLOBAL-POOL"
      + object_type              = "resourcepool.Pool"
      + organization             = [
          + {
              + additional_properties = ""
              + class_id              = "mo.MoRef"
              + moid                  = "60198e2c6972652d3096c7ac"
              + object_type           = "organization.Organization"
              + selector              = ""
            },
        ]
      + owners                   = (known after apply)
      + parent                   = (known after apply)
      + permission_resources     = (known after apply)
      + pool_type                = "Static"
      + resource_pool_parameters = [
          + {
              + additional_properties = jsonencode(
                    {
                      + ManagementMode = "IntersightStandalone"
                    }
                )
              + class_id              = "resourcepool.ServerPoolParameters"
              + object_type           = "resourcepool.ServerPoolParameters"
            },
        ]
      + resource_type            = "Server"
      + selectors                = [
          + {
              + additional_properties = ""
              + class_id              = "resource.Selector"
              + object_type           = "resource.Selector"
              + selector              = "/api/v1/compute/RackUnits?$filter=(Moid in ('649ded3361767536017e8026','64b1efc46176753601075b86')) and (ManagementMode eq 'IntersightStandalone')"
            },
        ]
      + shared_scope             = (known after apply)
      + size                     = (known after apply)
      + tags                     = []
      + version_context          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Creating...
module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Creation complete after 1s [id=64c843326962753101d7c58a]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
tritu$
```

From the Intersight GUI, the new pool is created but the size is zero (0).  Re-run terraform apply is always showing that the change in selectors 
```
tritu$ terraform apply --auto-approve
module.pools.data.intersight_organization_organization.cds_ce_org: Reading...
module.pools.data.intersight_organization_organization.default_org: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Reading...
module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Refreshing state... [id=64c843326962753101d7c58a]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Read complete after 1s [id=64ad87e2617675360127a394]
module.pools.data.intersight_organization_organization.default_org: Read complete after 1s [id=60198e2c6972652d3096c7ac]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Read complete after 1s [id=649ded3361767536017e8026]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Read complete after 1s [id=64b1efc46176753601075b86]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Read complete after 1s [id=64ad8817617675360127b7b2]
module.pools.data.intersight_organization_organization.cds_ce_org: Read complete after 1s [id=64c8268a6972653001e7242d]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL will be updated in-place
  ~ resource "intersight_resourcepool_pool" "CDS-CE-GLOBAL-POOL" {
        id                       = "64c843326962753101d7c58a"
        name                     = "CDS-CE-GLOBAL-POOL"
      ~ selectors                = [
          + {
              + additional_properties = ""
              + class_id              = "resource.Selector"
              + object_type           = "resource.Selector"
              + selector              = "/api/v1/compute/RackUnits?$filter=(Moid in ('649ded3361767536017e8026','64b1efc46176753601075b86')) and (ManagementMode eq 'IntersightStandalone')"
            },
        ]
        tags                     = []
        # (20 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Modifying... [id=64c843326962753101d7c58a]
module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Modifications complete after 0s [id=64c843326962753101d7c58a]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
tritu$
```

But if I edit the resource pool from Intersight GUI by select the resource from resource list, terraform apply has no changes
```
tritu$ terraform apply --auto-approve
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Reading...
module.pools.data.intersight_organization_organization.default_org: Reading...
module.pools.data.intersight_organization_organization.cds_ce_org: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Reading...
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Reading...
module.pools.intersight_resourcepool_pool.CDS-CE-GLOBAL-POOL: Refreshing state... [id=64c843326962753101d7c58a]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-4: Read complete after 0s [id=64ad8817617675360127b7b2]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-c432-109-10: Read complete after 0s [id=64b1efc46176753601075b86]
module.pools.data.intersight_organization_organization.default_org: Read complete after 0s [id=60198e2c6972652d3096c7ac]
module.pools.data.intersight_organization_organization.cds_ce_org: Read complete after 0s [id=64c8268a6972653001e7242d]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-11: Read complete after 0s [id=649ded3361767536017e8026]
module.pools.data.intersight_compute_rack_unit.ucsc-lab-sjc5-109-5: Read complete after 0s [id=64ad87e2617675360127a394]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
tritu$
```

So the terraform apply is executed but there is nothing apply to Intersight